In [1]:
import pandas as pd
df = pd.read_csv("data.csv")

In [9]:
df.describe()

                id    tax
count  1000.000000  654.0
mean    500.500000   20.0
std     288.819436    0.0
min       1.000000   20.0
25%     250.750000   20.0
50%     500.500000   20.0
75%     750.250000   20.0
max    1000.000000   20.0

In [10]:
df.price_paid = df.price_paid.apply(lambda x: x.replace("$",""))
df.price_paid = df.price_paid.astype(float)

In [11]:
df["price_paid"].mean()

6.461930000000001

In [12]:
df["price_paid"].sum()

6461.93

In [14]:
df["country"].unique()

array(['Canada', 'United States', 'Morocco', 'France', nan], dtype=object)

In [15]:
df["country"].value_counts()

France           408
United States    333
Canada           161
Morocco           54
Name: country, dtype: int64

In [17]:
df["gender"].value_counts(normalize=True)

Female    0.529538
Male      0.470462
Name: gender, dtype: float64

In [26]:
df.groupby("country").sum()

                   id  price_paid     tax
country
Canada          70365     1017.45  2160.0
France         214440     2619.61  5100.0
Morocco         26591      362.97   780.0
United States  168150     2183.67  4520.0

In [27]:
df.groupby("country").sum()["price_paid"].sort_values(ascending=False)

country
France           2619.61
United States    2183.67
Canada           1017.45
Morocco           362.97
Name: price_paid, dtype: float64

In [28]:
df.groupby("country").sum()["tax"].sort_values(ascending=False)

country
France           5100.0
United States    4520.0
Canada           2160.0
Morocco           780.0
Name: tax, dtype: float64

In [32]:
df.groupby("gender")["price_paid"].sum()

gender
Female    3165.26
Male      2833.61
Name: price_paid, dtype: float64

In [33]:
df.groupby(["gender", "country"]).mean()

                              id  price_paid   tax
gender country
Female Canada         461.472973    6.419324  20.0
       France         512.648241    6.350352  20.0
       Morocco        479.925926    7.024815  20.0
       United States  487.282353    6.437118  20.0
Male   Canada         406.000000    6.117467  20.0
       France         534.928177    6.498950  20.0
       Morocco        483.652174    6.146957  20.0
       United States  525.284722    6.672500  20.0